# Exercise 4.9 Assigment Part 1

In [1]:
#Importing Libraries 
import pandas as pd
import numpy as np
import os

In [2]:
path=r'/Users/ritviksolanki/Desktop/Instacart Basket Analysis /02 Data/Original data/customers.csv'

In [3]:
#Importing Customer Dataframe
customer=pd.read_csv(os.path.join(path),index_col=False)

# Data Wrangling

In [4]:
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [5]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [6]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Data Wrangling Steps

1. Surnam needs to be renamed to 'Surname'
2. First Name needs to be renamed to 'first_name'
3. Gender needs to be renamed to 'gender'
4. STATE needs to be renamed to 'state'
5. Age needs to be renamed to 'age'
6. Drop n_dependents since it is unecessarary for analysis 
7. user_id should be joined with primary key in df_ords_prods_merged dataframe

Renaming Column

df.rename(columns={'original_col_name':'new_col_name'},inplace=True)

In [9]:
#renaming columns
customer.rename(columns={'First Name':'first_name'},inplace=True)
customer.rename(columns={'Surnam':'surname'},inplace=True)
customer.rename(columns={'Gender':'gender'},inplace=True)
customer.rename(columns={'Age':'age'},inplace=True)
customer.rename(columns={'STATE':'state'},inplace=True)

In [10]:
#Check updates
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Perform the data quality and data consistency checks. Check for missing values and duplicats and convert mixed type data

In [13]:
#Check if there is mixed type data
for col in customer.columns.tolist():
    weird=(customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis=1)
    if len(customer[weird])>0:
           print(col)

first_name

The 'first_name' column contains mixed type data

In [14]:
#find NaN value 
print(customer['first_name'].isna().sum())

11259

In [15]:
#locate Nan
customer.loc[customer['first_name'].isna()]

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [16]:
#Inpute Nan values with 'Uknown'
customer['first_name'].fillna('Uknown',inplace=True)

In [18]:
#check for a second time if there are mixed value types
for col in customer.columns.tolist():
 weird =(customer[[col]].applymap(type) !=customer[[col]].iloc[0].apply(type)).any(axis=1)
if len(customer[weird])>0:
    print(col)

Check if there are missing values

In [19]:
customer.isnull().sum()

user_id         0
first_name      0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

There are no missing values.

Check if there are duplicates

In [20]:
customer[customer.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

Combine customer data set with df_ords_prods_agg on user_id

In [21]:
#import df_ords_prods_agg
df_ords_prods_agg=pd.read_pickle(r'/Users/ritviksolanki/Desktop/Instacart Basket Analysis /02 Data/Prepared Data/orders_products_aggregated_data.pkl')

In [22]:
#Merge df_ords_prods_agg and customer using user_id
df_ords_prods_merged=df_ords_prods_agg.merge(customer,on=['user_id'])

In [23]:
df_ords_prods_merged.shape

(32434212, 34)

In [25]:
path=r'/Users/ritviksolanki/Desktop/Instacart Basket Analysis /02 Data/Prepared Data'

In [26]:
#Export to pickle file 
df_ords_prods_merged.to_pickle(os.path.join(path,'df_ords_prods_merged2.pkl'))